/*
SQLyog Professional v13.1.1 (64 bit)
MySQL - 10.1.37-MariaDB : Database - selectcoursedb
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`selectcoursedb` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `selectcoursedb`;

/*Table structure for table `student` */

DROP TABLE IF EXISTS `student`;

CREATE TABLE `student` (
  `student_id` int(11) NOT NULL,
  `student_passwd` varchar(20) DEFAULT NULL,
  `student_name` varchar(50) DEFAULT NULL,
  `student_sex` char(2) DEFAULT NULL,
  `student_birthday` datetime DEFAULT NULL,
  `class_id` varchar(60) DEFAULT NULL,
  `major_id` char(6) DEFAULT NULL,
  `department_id` varchar(60) DEFAULT NULL,
  `student_reg_time` datetime DEFAULT NULL,
  PRIMARY KEY (`student_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `student` */

insert  into `student`(`student_id`,`student_passwd`,`student_name`,`student_sex`,`student_birthday`,`class_id`,`major_id`,`department_id`,`student_reg_time`) values 
(111020114,'123456','孙雨晴','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111020227,'123457','范文虎','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022101,'123458','梁叶彬','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022102,'123459','宓鑫妍','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022103,'123460','赵康靖','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022104,'123461','乔敏','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022106,'123462','曹娟','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022107,'123463','陈小妍','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022108,'123464','饶淑琴','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022110,'123465','刘亚新','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022111,'123466','刘秀文','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022112,'123467','王嘉琪','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022113,'123468','张佳滢','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022114,'123469','鄂邦仪','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022115,'123470','余明菊','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022116,'123471','方彬','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022117,'123472','王铭娟','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022118,'123473','张阳如','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022119,'123474','李礼','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022120,'123475','韦蒋凝','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022121,'123476','陈颖','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022122,'123477','苏春芳','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022123,'123478','李丹丹','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022124,'123479','庞露丹','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022125,'123480','张欣','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022126,'123481','张粱予','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022127,'123482','黄博','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022128,'123483','李世伟','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022129,'123484','崔胡越','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022130,'123485','王一霖','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022131,'123486','余青云','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022132,'123487','李广冀','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022133,'123488','黎才科','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022134,'123489','张佳浩','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022135,'123490','王宇','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022136,'123491','张殿融','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022137,'123492','王楷文','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022138,'123493','耿旭超','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022139,'123494','卢雄坳','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022140,'123495','陈宇豪','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022141,'123496','沈河伯','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00'),
(111022143,'123497','李首言','男','2002-01-01 00:00:00','园林221','园林技术','风景园林技术系','2022-09-01 00:00:00');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
